a = 5
b = 6
a_bin = bin(a)
b_bin = bin(b)
print(f'Двоичное представление {a} = {a_bin} {b} = {b_bin}')
print(f'Результат операции И на числами {a_bin} и {b_bin}: {a & b} т.к.  0b100 = {int(0b100)}')
print(f'Результат операции ИЛИ на числами {a_bin} и {b_bin}: {a | b} т.к.  0b111 = {int(0b111)}')
print(f'Результат операции ИСЛЮЧАЮЩЕЕ ИЛИ на числами {a_bin} и {b_bin}: {a ^ b} т.к. 0b011 = {int(0b011)}')
print(f'Сдвиг ВПРАВО НА 2 БИТА число {a_bin} равно {a >> 2} т.к. 0b001 = {int(0b001)}')
print(f'Сдвиг ВЛЕВО НА 2 БИТА число {a_bin} равно {a << 2} т.к. 0b10100 = {int(0b10100)}')